FOAM/channelFlowTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ()

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  on;
//adjustTimeStep  off;

maxCo           1.25;

maxDeltaT       1;
maxAlphaCo      1.25;


functions
{
    //#include "surfaces"
    #include "forces"
    #include "sampleLines"
/*    #includeFunc fieldAverage(U, p,k,nut,omega,base=time,startTime=0,window=50, prime2Mean = yes)
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;

        fields
        (
            U p nut
        );

        probeLocations
        (
            (0.1 0 0)
            (0.1 0 0.1)
            (0.1 0 0.2)
            (0.1 0 0.3)
            (0.1 0 0.4)
            (0.1 0 0.5)
            (0.4 0 0)
            (0.4 0 0.1)
            (0.4 0 0.2)
            (0.4 0 0.3)
            (0.4 0 0.4)
            (0.4 0 0.5)
        );
    }
*/
}

// ************************************************************************* //
