FOAM/channelFlowTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1600;
        startFace       3120;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-0.05 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1600;
        startFace       4720;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (0.05 0 0);
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          40;
        startFace       6320;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       6360;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       6400;
    }
)

// ************************************************************************* //
