FOAM/channelFlowTest/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet)"
    {
        type            cyclic;
    }
    "(bottom|sides)"
    {
        type            nutkRoughWallFunction;
        type            nutUSpaldingWallFunction;
        type            nutkWallFunction;
        Ks              uniform 1e-4;
        Cs              uniform 0.5;
        value           $internalField;
    }
    top
    {
        type            symmetryPlane;
        value           $internalField;
    }
    "LF.*"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
