FOAM/channelFlowTest/system/sampleSets
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

sampleSets
{
    type            sets;
    libs            ("libsampling.so");

    writeControl    writeTime;

    setFormat       raw;
    fields          (wallShearStress);

    interpolationScheme cellPoint;

    sets
    (

        point1
        {
            type        points;
            points
            (
               #include "output.txt"

            );
            ordered     no;
            axis        xyz;
        }
       
    );
      
}
// ************************************************************************* //
