FOAM/channelFlowTest/system/topoSetDict2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c_refined;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10 -10 -1) (10 10 0.02);
        }
    }
    {
        name    c_refined;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {   
            box (-10 -10 0.48) (10 10 1);
        }
    }

);

// ************************************************************************* //
